### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [196]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [197]:
Players = len(purchase_data["SN"].unique())
print(Players)

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [198]:
purchase_data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [199]:
Unique_Items = len(purchase_data["Item_ID"].unique())
print(Unique_Items)

183

In [200]:
Unique_Items = len(purchase_data["Item_ID"].unique())
Average_Price = purchase_data["Price"].mean()
Age_Mean = purchase_data["Age"].mean()
Number_Purchases = len(purchase_data["Purchase_ID"].unique())
Total_Price = purchase_data["Price"].sum()

In [201]:
summary_table = pd.DataFrame({"Nuber of Unique Items": [Unique_Items],
                              "Average Price": [Average_Price],
                              "Age Mean": [Age_Mean],
                              "Number of Purchases": [Number_Purchases],
                              "Total Ravenue": [Total_Price]})
summary_table["Total Ravenue"] = summary_table["Total Ravenue"].astype(float).map("${:,.2f}".format)
summary_table["Average Price"] = summary_table["Average Price"].astype(float).map("${:,.2f}".format)
summary_table["Age Mean"] = summary_table["Age Mean"].astype(float).map("{:,.2f}".format)
summary_table

,Nuber of Unique Items,Average Price,Age Mean,Number of Purchases,Total Ravenue
0,183,$3.05,22.71,780,"$2,379.77"

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [202]:
purchase_data.loc[:, ["SN", "Gender"]].head()

              SN Gender
0        Lisim78   Male
1    Lisovynya38   Male
2     Ithergue48   Male
3  Chamassasya86   Male
4      Iskosia90   Male

In [203]:
cleared = purchase_data.drop_duplicates(["SN"], keep= "last")

In [204]:
cleared.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18

In [205]:
cleared.Gender.value_counts()

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [206]:
Total_Players = len(cleared["Gender"])
print(Total_Players)

576

In [207]:
Summary_Table = pd.DataFrame({
    "Gender": ["Male", "Female", "Other / Non-Disclosed"],
    "Total Count": ["484", "81", "11"],
    "Percentage of Players": [(484/576) * 100, (81/576) * 100, (11/576) * 100]
    })
Summary_Table["Percentage of Players"] = Summary_Table["Percentage of Players"].astype(float).map("${:,.2f}".format)
Summary_Table

                  Gender Total Count Percentage of Players
0                   Male         484                $84.03
1                 Female          81                $14.06
2  Other / Non-Disclosed          11                 $1.91

## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [208]:
purchase_data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [209]:
purchase_data.Gender.value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [210]:
columns = ["Gender", "Price"]

In [211]:
Gender_Male = purchase_data.loc[purchase_data["Gender"] == "Male",  columns]
Male_Total = Gender_Male["Price"].sum()
print(Male_Total)

1967.64

In [212]:
Male_Avr = Gender_Male["Price"].mean()
print(Male_Avr)

3.0178527607361953

In [213]:
Gender_Female = purchase_data.loc[purchase_data["Gender"] == "Female",  columns]
Female_Total = Gender_Female["Price"].sum()
print(Female_Total)

361.94

In [214]:
Female_Avr = Gender_Female["Price"].mean()
print(Female_Avr)

3.203008849557519

In [215]:
Gender_Other = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed",  columns]
Other_Total = Gender_Other["Price"].sum()
print(Other_Total)

50.19

In [216]:
Other_Avr = Gender_Other["Price"].mean()
print(Other_Avr)

3.3460000000000005

In [217]:
Summary_Table = pd.DataFrame({
    "Gender": ["Female", "Male", "Other / Non-Disclosed"],
    "Purchase Count": ["113", "652", "15"],
    "Average Purchase Price": [Female_Avr, Male_Avr, Other_Avr],
    "Total Purchase Value": [Female_Total, Male_Total, Other_Total],
    "Avg Total Purchase per Person": [Female_Total/81, Male_Total/484, Other_Total/11]
    })
Summary_Table["Average Purchase Price"] = Summary_Table["Average Purchase Price"].astype(float).map("${:,.2f}".format)
Summary_Table["Total Purchase Value"] = Summary_Table["Total Purchase Value"].astype(float).map("${:,.2f}".format)
Summary_Table["Avg Total Purchase per Person"] = Summary_Table["Avg Total Purchase per Person"].astype(float).map("${:,.2f}".format)

Summary_Table

,Gender,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
0,Female,113,$3.20,$361.94,$4.47
1,Male,652,$3.02,"$1,967.64",$4.07
2,Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [218]:
print(cleared["Age"].max())
print(cleared["Age"].min())

45
7

In [219]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 45]
Groups = ["<10", "11-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [220]:
pd.cut(cleared["Age"], bins, labels=Groups).head()

1      40+
2    20-24
3    20-24
4    20-24
6    35-39
Name: Age, dtype: category
Categories (8, object): [<10 < 11-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [221]:
cleared["Age_Groups"] = pd.cut(cleared["Age"], bins, labels=Groups)
cleared.head()

C:\Users\Suleyman\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age_Groups
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
6,6,Itheria73,36,Male,169,"Interrogator, Blood Blade of the Queen",2.18,35-39

In [222]:
grouping = cleared.groupby("Age_Groups")
print (grouping["Age"].count())

Age_Groups
<10       17
11-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [223]:
grouping[["Age"]].count()

            Age
Age_Groups
<10          17
11-14        22
15-19       107
20-24       258
25-29        77
30-34        52
35-39        31
40+          12

In [224]:
Summary_Table = pd.DataFrame({
    "Age Groups": ["<10", "11-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"],
    "Total Count": ["17", "22", "107", "258", "77", "52", "31", "12"],
    "Percentage of Players (%)": [17/576*100, 22/576*100,107/576*100, 258/576*100, 77/576*100, 52/576*100, 31/576*100, 12/576*100]    
    })
Summary_Table["Percentage of Players (%)"] = Summary_Table["Percentage of Players (%)"].astype(float).map("{:,.2f}".format)
Summary_Table

  Age Groups Total Count Percentage of Players (%)
0        <10          17                      2.95
1      11-14          22                      3.82
2      15-19         107                     18.58
3      20-24         258                     44.79
4      25-29          77                     13.37
5      30-34          52                      9.03
6      35-39          31                      5.38
7        40+          12                      2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [225]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 45]

In [226]:
groups = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [227]:
pd.cut(purchase_data["Age"], bins, labels=groups).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [228]:
purchase_data["Age_Groups"] = pd.cut(purchase_data["Age"], bins, labels=groups)
purchase_data.head()

,Purchase_ID,SN,Age,Gender,Item_ID,Item_Name,Price,Age_Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [229]:
groups = purchase_data.groupby("Age_Groups")
print(groups["Age"].count())
print(groups["Price"].mean())

Age_Groups
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64
Age_Groups
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [230]:
groups = cleared.groupby("Age_Groups")
print(groups["Age"].count())

Age_Groups
<10       17
11-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [231]:
raw_data = pd.DataFrame({
    "Age_Groups": ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"],
    "Purchase_Count": ["23", "28", "136", "365", "101", "73", "41", "13"],
    "Number_of_Purchasers": ["17","22","107","258","77","52","31","12"],
    "Average_Purchase_Price": ["3.353478", "2.956429", "3.035956", "3.052219", "2.900990", "2.931507", "3.601707", "2.941538"]
    })
raw_data

  Age_Groups Purchase_Count Number_of_Purchasers Average_Purchase_Price
0        <10             23                   17               3.353478
1      10-14             28                   22               2.956429
2      15-19            136                  107               3.035956
3      20-24            365                  258               3.052219
4      25-29            101                   77               2.900990
5      30-34             73                   52               2.931507
6      35-39             41                   31               3.601707
7        40+             13                   12               2.941538

In [232]:
raw_data["Purchase_Count"] = raw_data.Purchase_Count.astype(float)
raw_data["Number_of_Purchasers"] = raw_data.Number_of_Purchasers.astype(float)
raw_data["Average_Purchase_Price"] = raw_data.Average_Purchase_Price.astype(float)

In [233]:
raw_data["Total_Purchase_Value"]=raw_data["Purchase_Count"]*raw_data["Average_Purchase_Price"]
raw_data["Avg_Total_Purchase_per_Person"]=raw_data["Total_Purchase_Value"]/raw_data["Number_of_Purchasers"]

raw_data["Average_Purchase_Price"] = raw_data["Average_Purchase_Price"].astype(float).map("${:,.2f}".format)
raw_data["Total_Purchase_Value"] = raw_data["Total_Purchase_Value"].astype(float).map("${:,.2f}".format)
raw_data["Avg_Total_Purchase_per_Person"] = raw_data["Avg_Total_Purchase_per_Person"].astype(float).map("${:,.2f}".format)

raw_data

,Age_Groups,Purchase_Count,Number_of_Purchasers,Average_Purchase_Price,Total_Purchase_Value,Avg_Total_Purchase_per_Person
0,<10,23.0,17.0,$3.35,$77.13,$4.54
1,10-14,28.0,22.0,$2.96,$82.78,$3.76
2,15-19,136.0,107.0,$3.04,$412.89,$3.86
3,20-24,365.0,258.0,$3.05,"$1,114.06",$4.32
4,25-29,101.0,77.0,$2.90,$293.00,$3.81
5,30-34,73.0,52.0,$2.93,$214.00,$4.12
6,35-39,41.0,31.0,$3.60,$147.67,$4.76
7,40+,13.0,12.0,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [234]:
Purchase_Count = purchase_data["SN"].value_counts()
Purchase_Count.head()

Lisosia93      5
Iral74         4
Idastidru52    4
Strithenu87    3
Phyali88       3
Name: SN, dtype: int64

In [235]:
grouped = purchase_data.groupby(["SN"])

In [236]:
grouped.count().head(15)

              Purchase_ID  Age  Gender  Item_ID  Item_Name  Price  Age_Groups
SN
Adairialis76            1    1       1        1          1      1           1
Adastirin33             1    1       1        1          1      1           1
Aeda94                  1    1       1        1          1      1           1
Aela59                  1    1       1        1          1      1           1
Aelaria33               1    1       1        1          1      1           1
Aelastirin39            2    2       2        2          2      2           2
Aelidru27               1    1       1        1          1      1           1
Aelin32                 3    3       3        3          3      3           3
Aelly27                 2    2       2        2          2      2           2
Aellynun67              1    1       1        1          1      1           1
Aellyria80              1    1       1        1          1      1           1
Aelollo59               2    2       2        2          2      2           2
Aenarap34               1    1       1        1          1      1           1
Aeral43                 1    1       1        1          1      1           1
Aeral68                 1    1       1        1          1      1           1

In [237]:
grouped["Price"].sum()

SN
Adairialis76       2.28
Adastirin33        4.48
Aeda94             4.91
Aela59             4.32
Aelaria33          1.79
Aelastirin39       7.29
Aelidru27          1.09
Aelin32            8.98
Aelly27            6.79
Aellynun67         3.74
Aellyria80         3.08
Aelollo59          5.63
Aenarap34          2.96
Aeral43            4.40
Aeral68            4.00
Aeral97            4.80
Aeralria27         4.09
Aeralstical35      2.96
Aeri84             1.61
Aerillorin70       3.33
Aerithllora36      8.64
Aerithnucal56      4.40
Aerithnuphos61     4.91
Aerithriaphos45    1.56
Aerithriaphos46    2.18
Aesri53            1.76
Aesty53            3.91
Aestysu37          5.38
Aesur96            2.21
Aesurstilis64      1.03
                   ...
Undosia27          3.77
Undosian34         8.30
Undotesta33        4.74
Wailin72           2.73
Yadacal26          6.54
Yadaisuir65        4.09
Yadam35            2.48
Yadanu52           2.38
Yadaphos40         5.35
Yalae81            6.69
Yalaeria91         1.06
Yaliru88           3.03
Yalo85             3.65
Yalostiphos68      4.40
Yana46             3.55
Yarithllodeu72     3.75
Yarithrgue83       3.45
Yarithrin84        4.14
Yarithsurgue62     4.94
Yarolwen77         4.43
Yasrisu92          3.44
Yastyriaphos75     4.75
Yasur35            4.48
Yasur85            1.10
Yathecal72         3.46
Yathecal82         6.22
Yathedeu43         6.02
Yoishirrala98      4.58
Zhisrisu83         7.89
Zontibe81          8.03
Name: Price, Length: 576, dtype: float64

In [238]:
Total_Purchase_Value = grouped["Price"].sum()
Total_Purchase_Value.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
Name: Price, dtype: float64

In [239]:
SummaryTab = pd.DataFrame({"Purchase Count": Purchase_Count,
                           "Average Purchase Price": Total_Purchase_Value / Purchase_Count,
                           "Total Purchase Value": Total_Purchase_Value})

SummaryTab.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [240]:
SummaryTab.sort_values(by="Total Purchase Value", ascending=False).head()

             Purchase Count  Average Purchase Price  Total Purchase Value
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [241]:
df = purchase_data[["Item_ID", "Item_Name", "Price"]]

In [242]:
grouping = df.groupby(["Item_ID","Item_Name"])

In [243]:
purchase_count = grouping["Price"].count()
item_price = purchase_value/purchase_count
purchase_value = grouping["Price"].sum()

In [244]:
The_Most_Popular = pd.DataFrame({"Purchase Count": purchase_count,
                                 "Item Price": item_price,
                                 "Total Purchase Value": purchase_value
                                })
popular_formatted = The_Most_Popular.sort_values(["Purchase Count"], ascending=False).head()
popular_formatted.style.format({"Item Price":"${:,.2f}","Total Purchase Value":"${:,.2f}"})

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [245]:
The_Most_Popular = pd.DataFrame({"Purchase Count": purchase_count,
                                 "Item Price": item_price,
                                 "Total Purchase Value": purchase_value
                                })
popular_formatted = The_Most_Popular.sort_values(["Total Purchase Value"], ascending=False).head()
popular_formatted.style.format({"Item Price":"${:,.2f}","Total Purchase Value":"${:,.2f}"})